function autocomplete(inp, arr) {
  /*the autocomplete function takes two arguments,
  the text field element and an array of possible autocompleted values:*/
  var currentFocus;
  /*execute a function when someone writes in the text field:*/
  inp.addEventListener("input", function (e) {
    var a, b, i, val = this.value;
    /*close any already open lists of autocompleted values*/
    closeAllLists();
    if (!val) { return false; }
    currentFocus = -1;
    /*create a DIV element that will contain the items (values):*/
    a = document.createElement("DIV");
    a.setAttribute("id", this.id + "autocomplete-list");
    a.setAttribute("class", "autocomplete-items");
    /*append the DIV element as a child of the autocomplete container:*/
    this.parentNode.appendChild(a);
    /*for each item in the array...*/
    for (i = 0; i < arr.length; i++) {
      /*check if the item starts with the same letters as the text field value:*/
      if (arr[i].substr(0, val.length).toUpperCase() == val.toUpperCase()) {
        /*create a DIV element for each matching element:*/
        b = document.createElement("DIV");
        /*make the matching letters bold:*/
        b.innerHTML = "<strong>" + arr[i].substr(0, val.length) + "</strong>";
        b.innerHTML += arr[i].substr(val.length);
        /*insert a input field that will hold the current array item's value:*/
        b.innerHTML += "<input type='hidden' value='" + arr[i] + "'>";
        /*execute a function when someone clicks on the item value (DIV element):*/
        b.addEventListener("click", function (e) {
          /*insert the value for the autocomplete text field:*/
          inp.value = this.getElementsByTagName("input")[0].value;
          /*close the list of autocompleted values,
          (or any other open lists of autocompleted values:*/
          closeAllLists();
        });
        a.appendChild(b);
      }
    }
  });
  /*execute a function presses a key on the keyboard:*/
  inp.addEventListener("keydown", function (e) {
    var x = document.getElementById(this.id + "autocomplete-list");
    if (x) x = x.getElementsByTagName("div");
    if (e.keyCode == 40) {
      /*If the arrow DOWN key is pressed,
      increase the currentFocus variable:*/
      currentFocus++;
      /*and and make the current item more visible:*/
      addActive(x);
    } else if (e.keyCode == 38) { //up
      /*If the arrow UP key is pressed,
      decrease the currentFocus variable:*/
      currentFocus--;
      /*and and make the current item more visible:*/
      addActive(x);
    } else if (e.keyCode == 13) {
      /*If the ENTER key is pressed, prevent the form from being submitted,*/
      e.preventDefault();
      if (currentFocus > -1) {
        /*and simulate a click on the "active" item:*/
        if (x) x[currentFocus].click();
      }
    }
  });
  function addActive(x) {
    /*a function to classify an item as "active":*/
    if (!x) return false;
    /*start by removing the "active" class on all items:*/
    removeActive(x);
    if (currentFocus >= x.length) currentFocus = 0;
    if (currentFocus < 0) currentFocus = (x.length - 1);
    /*add class "autocomplete-active":*/
    x[currentFocus].classList.add("autocomplete-active");
  }
  function removeActive(x) {
    /*a function to remove the "active" class from all autocomplete items:*/
    for (var i = 0; i < x.length; i++) {
      x[i].classList.remove("autocomplete-active");
    }
  }
  function closeAllLists(elmnt) {
    /*close all autocomplete lists in the document,
    except the one passed as an argument:*/
    var x = document.getElementsByClassName("autocomplete-items");
    for (var i = 0; i < x.length; i++) {
      if (elmnt != x[i] && elmnt != inp) {
        x[i].parentNode.removeChild(x[i]);
      }
    }
  }
  /*execute a function when someone clicks in the document:*/
  document.addEventListener("click", function (e) {
    closeAllLists(e.target);
  });
}

/*An array containing all the country names in the world:*/
var countries = ['AJ네트웍스보통주', 'AK홀딩스보통주', 'BGF리테일보통주', 'BGF보통주', 'BNK금융지주보통주', 'BYC1우선주', 'BYC보통주', 'CJ1우선주', 'CJ4우선주(전환)', 'CJ보통주', 'CJ씨푸드1우선주', 'CJ씨푸드보통주', 'CS홀딩스보통주',  'DB Inc.보통주', 'DB금융투자보통주', 'DB손해보험보통주', 'DB하이텍1우선주', 'DB하이텍보통주', 'DGB금융지주보통주', 'DI동일보통주', 'DL1우선주', 'DL건설보통주', 'DL보통주', 'DL이앤씨1우선주', 'DL이앤씨보통주', 'DSR보통주', 'DSR제강보통주', 'E1보통주', 'ESR켄달스퀘어리츠보통주',
  'F&F보통주', 'F&F홀딩스', 'GS1우선주', 'GS건설보통주', 'GS보통주', 'HDC보통주', 'HDC현대산업개발보통주', 'IHQ보통주', 'JB금융지주보통주', 'JW생명과학보통주', 'JW중외제약1우선주', 'JW중외제약2우선주(신형)',  'JW중외제약보통주','JW홀딩스 보통주','KB금융지주 보통주','KCTC 보통주','KG동부제철1우선주',  'KG동부제철보통주',  'KG케미칼보통주',  'KH 필룩스보통주',  'KISCO홀딩스보통주',  'KPX케미칼보통주',  'KPX홀딩스보통주',  'KR모터스보통주', 'LF보통주','LG1우선주',  'LG디스플레이보통주',  'LG보통주',  
  'LG생활건강1우선주',  'LG생활건강보통주',  'LG유플러스보통주',  'LG이노텍보통주',  'LG전자1우선주',  'LG전자보통주',  'LG화학1우선주',  'LG화학보통주',  'LIG넥스원보통주',  'LS ELECTRIC보통주',  'LS네트웍스보통주',  'LS보통주',  'LX인터내셔널보통주',  'MH에탄올보통주',  'NAVER보통주',  'NHN보통주',  'NH프라임리츠보통주',  'NICE보통주',  'NI스틸보통주',  'NPC1우선주',  'NPC보통주',  'OCI보통주',  'S-Oil1우선주',  'S-Oil보통주', 'SBS미디어홀딩스보통주',  'SGC에너지보통주',  'SG글로벌보통주',  'SHD보통주', 
  'SH에너지화학보통주',  'SIMPAC보통주',  'SJM보통주',  'SJM홀딩스보통주',  'SK1우선주',  'SKC보통주',  'SK가스보통주',  'SK네트웍스1우선주',  'SK네트웍스보통주',  'SK디앤디보통주',  'SK리츠보통주',  'SK보통주',  'SK스퀘어보통주',  'SK아이이테크놀로지보통주',  'SK이노베이션 1우선주',  'SK이노베이션 보통주',  'SK증권1우선주',  'SK증권보통주',  'SK케미칼1우선주',  'SK케미칼보통주',  'SK텔레콤보통주',  'SNT모티브보통주', 'SNT에너지보통주',  'SNT중공업보통주',  'SNT홀딩스보통주',  'SPC삼립보통주',  'STX보통주',  
  'STX엔진보통주',  'STX중공업보통주',  'TBH글로벌보통주',  'TCC스틸보통주',  'WISCOM보통주',  '가온전선보통주',  '강남제비스코보통주',  '강원랜드보통주',  '갤럭시아에스엠보통주',  '경농보통주',  '경동나비엔보통주',  '경동도시가스보통주',  '경동인베스트보통주',  '경방보통주',  '경보제약보통주',  '경인양행보통주',  '경인전자보통주',  '계룡건설산업보통주',  '계양전기1우선주',  '계양전기보통주',  '고려산업보통주', '고려아연보통주',  '고려제강보통주',  '광동제약보통주',  '광명전기보통주',  '광전자보통주',  '광주신세계보통주', 
  '교보증권보통주',  '교촌에프앤비보통주',  '국도화학보통주',  '국동보통주',  '국보보통주',  '국제약품보통주',  '그랜드코리아레저보통주',  '그린케미칼보통주', '극동유화보통주',  '금강공업1우선주',  '금강공업보통주',  '금비보통주',  '금양보통주',  '금호건설1우선주',  '금호건설보통주',  '금호석유화학1우선주',  '금호석유화학보통주',  '금호에이치티보통주',  '금호전기보통주',  '금호타이어보통주', '기신정기 보통주',  '기아보통주',  '까뮤이앤씨보통주',  '깨끗한나라1우선주',  '깨끗한나라보통주',  '남광토건보통주',  '남선알미늄1우선주',  
  '남선알미늄보통주',  '남성보통주',  '남양유업1우선주',  '남양유업보통주',  '남해화학보통주',  '넥센1우선주',  '넥센보통주',  '넥센타이어1우선주(신형)',  '넥센타이어보통주',  '넥스트사이언스보통주',  '넷마블보통주',  '노루페인트 1우선주',  '노루페인트 보통주',  '노루홀딩스1우선주',  '노루홀딩스보통주',  '녹십자보통주',  '녹십자홀딩스2우선주(신형)',  '녹십자홀딩스보통주',   '농심보통주',  '농심홀딩스보통주',  '다스코보통주',  '다우기술보통주',  '다이나믹디자인보통주',  '대교보통주',  '대교우선주(신형)',  '대구백화점보통주',  
  '대덕1우선주',  '대덕보통주',  '대덕전자보통주',  '대덕전자우선주',  '대동보통주',  '대동전자보통주',  '대림B&Co보통주',  '대림통상보통주',  '대상1우선주',  '대상보통주',  '대상홀딩스 1우선주',  '대상홀딩스 보통주',  '대성산업보통주',  '대성에너지보통주',  '대성홀딩스보통주',  '대신증권1우선주',  '대신증권2우선주(신형)',  '대신증권보통주', '대양금속보통주',  '대영포장보통주',  '대우건설보통주',  '대우전자부품보통주',  '대우조선해양보통주',  '대웅보통주',  '대웅제약보통주',  '대원강업보통주',  '대원전선1우선주',  '대원전선보통주',
  '대원제약보통주',  '대원화성보통주',  '대유에이텍',  '대유플러스보통주',  '대창단조보통주',  '대창보통주',  '대한방직보통주',  '대한유화보통주',  '대한전선보통주',  '대한제강 보통주',  '대한제당1우선주',  '대한제당보통주',  '대한제분보통주',  '대한항공1우선주',  '대한항공보통주',  '대한해운보통주',  '대한화섬보통주',  '대현보통주', '대호에이엘보통주',  '더블유게임즈보통주',  '더존비즈온보통주',  '덕성1우선주',  '덕성보통주',  '덕양산업보통주',  '덴티움보통주',  '도화엔지니어링보통주',  '동국제강보통주',  '동방보통주',  '동방아그로보통주',  
  '동부건설1우선주',  '동부건설보통주', '동서보통주',  '동성제약보통주',  '동성케미컬보통주',  '동아쏘시오홀딩스보통주',  '동아에스티보통주',  '동아지질보통주',  '동아타이어공업보통주',  '동양1우선주',  '동양2우선주(신형)',  '동양3우선주(신형)',  '동양고속보통주',  '동양보통주',  '동양생명보험보통주',  '동양철관보통주',  '동양피스톤보통주',  '동원F&B보통주',  '동원금속보통주',  '동원산업보통주',  '동원수산보통주',  '동원시스템즈1우선주',  '동원시스템즈보통주',  '동일고무벨트보통주',  '동일산업보통주',  '동일제강보통주',  '동화약품보통주', 
  '두산1우선주',  '두산2우선주(신형)',  '두산밥캣보통주',  '두산보통주',  '두산중공업보통주',  '두산퓨얼셀1우선주',  '두산퓨얼셀2우선주(신형)',  '두산퓨얼셀보통주',  '두올보통주',  '드림텍보통주',  '디씨엠보통주',  '디아이보통주',  '디아이씨 보통주',  '디알비동일보통주',  '디앤디플랫폼리츠보통주',  '디와이보통주',
  '디와이파워보통주',  '디티알오토모티브보통주',  '디피씨보통주',  '락앤락보통주',  '롯데관광개발 보통주',  '롯데렌탈보통주',  '롯데리츠보통주',  '롯데손해보험보통주',  '롯데쇼핑 보통주',  '롯데정밀화학보통주',  '롯데정보통신보통주',  '롯데제과보통주',  '롯데지주1우선주',  '롯데지주보통주',  '롯데칠성음료1우선주',  '롯데칠성음료보통주',  '롯데케미칼보통주',  '롯데푸드보통주',  '롯데하이마트보통주',  '마니커보통주',  '만도보통주',  '만호제강보통주',  '맥쿼리한국인프라투융자회사 보통주',  '메리츠금융지주회사보통주',  '메리츠증권보통주',  
  '메리츠화재해상보험보통주',  '메타랩스보통주',  '명문제약 보통주',  '명신산업보통주',  '모나리자보통주',  '모나미보통주',  '모두투어리츠보통주',  '모토닉보통주',  '무림페이퍼보통주',  '무림피앤피보통주',  '무학보통주',  '문배철강보통주',  '미래산업보통주',  '미래아이앤지보통주',  '미래에셋글로벌리츠보통주', '미래에셋맵스리츠보통주',  '미래에셋맵스아시아퍼시픽부동산공모1호',  '미래에셋생명보험보통주', '미래에셋증권1우선주',  '미래에셋증권2우선주(신형)',  '미래에셋증권보통주',  '미원상사보통주',  '미원스페셜티케미칼보통주',  
  '미원홀딩스 보통주', '미원화학보통주',  '미창석유공업보통주',  '바다로19호선박투자회사',  '방림보통주',  '백광산업보통주',  '백산보통주',  '범양건영보통주',  '벽산보통주',  '보락보통주',  '보령제약보통주', '보해양조보통주',  '부광약품보통주',  '부국증권1우선주',  '부국증권보통주', '부국철강 보통주',  '부산도시가스보통주',  '부산산업보통주',  '부산주공보통주',  '비비안보통주',  '비상교육 보통주',  '비케이탑스보통주',  '빙그레보통주',  '사조대림보통주',  '사조동아원보통주',  '사조산업보통주',
  '사조씨푸드보통주',  '사조오양보통주', '삼부토건보통주', '삼성SDI1우선주',  '삼성SDI보통주',  '삼성공조보통주',  '삼성물산1우선주(신형)',  '삼성물산보통주',  '삼성바이오로직스보통주',  '삼성생명보험보통주',  '삼성에스디에스보통주',  '삼성엔지니어링보통주',  '삼성전기1우선주',  '삼성전기보통주',  '삼성전자1우선주', '삼성전자보통주',  '삼성제약',  '삼성중공업1우선주',  '삼성중공업보통주',  '삼성증권보통주',  '삼성출판사보통주',  '삼성카드 보통주',  '삼성화재해상보험1우선주',  '삼성화재해상보험보통주',  '삼아알미늄보통주',  '삼양사1우선주', 
  '삼양사보통주',  '삼양식품보통주',  '삼양통상보통주',  '삼양패키징보통주',  '삼양홀딩스1우선주',  '삼양홀딩스보통주',  '삼영무역보통주',  '삼영전자공업보통주',  '삼영화학공업보통주',  '삼원강재 보통주',  '삼익THK보통주',  '삼익악기보통주',  '삼일씨엔에스보통주',  '삼일제약보통주',  '삼정펄프 보통주',  '삼진제약보통주',  '삼천리보통주',  '삼호개발 보통주',  '삼화왕관보통주',
  '삼화전기보통주',  '삼화전자공업보통주',  '삼화콘덴서공업보통주',  '삼화페인트공업보통주',  '상상인증권보통주',  '상신브레이크보통주',  '새론오토모티브',  '샘표보통주',  '샘표식품보통주', '서연보통주',  '서연이화보통주', '서울도시가스보통주',  '서울식품공업1우선주',  '서울식품공업보통주',  '서원보통주',  '서흥보통주',  '선도전기보통주',  '선앤엘보통주',  '선진보통주',  '성문전자1우선주',  '성문전자보통주',  '성보화학보통주', '성신양회1우선주',  '성신양회보통주',  '성안보통주',  '성창기업지주보통주',  '세기상사보통주',  '세방1우선주', 
  '세방보통주',  '세방전지보통주',  '세아베스틸보통주',  '세아제강보통주',  '세아제강지주보통주',  '세아특수강보통주',  '세아홀딩스보통주', '세우글로벌보통주',  '세원이앤씨보통주',  '세원정공보통주', '세이브존I&C보통주',  '세종공업보통주',  '세진중공업보통주',  '세하보통주',  '센트랄모텍보통주', '센트럴인사이트보통주', '셀트리온보통주',  '솔루스첨단소재1우선주',  '솔루스첨단소재2우선주(신형)',  '솔루스첨단소재보통주', '솔루엠보통주',  '송원산업보통주',  '수산중공업보통주', '시디즈보통주',  '신대양제지보통주', '신도리코보통주',  '신라교역보통주', 
   '신성이엔지보통주',  '신성통상보통주',  '신세계건설',  '신세계보통주',  '신세계아이앤씨 보통주', '신세계인터내셔날보통주',  '신세계푸드보통주',  '신송홀딩스보통주', '신영와코루보통주', '신영증권1우선주', '신영증권보통주',  '신원1우선주', '신원보통주', '신일전자보통주',  '신풍제약1우선주',  '신풍제약보통주',  '신풍제지보통주',  '신한금융지주회사보통주',  '신한서부티엔디리츠보통주',  '신한알파리츠보통주', '신흥보통주',  '쌍방울',  '쌍용C&E보통주', '쌍용자동차보통주',  '써니전자보통주',  '쎌마테라퓨틱스보통주',
  '씨아이테크보통주',  '씨에스윈드보통주',  '씨제이대한통운보통주',  '씨제이씨지브이 보통주',  '씨제이제일제당 주식회사 1우선주', '씨제이제일제당 주식회사 보통주', '아남전자보통주',  '아모레G1우선주', '아모레G3우선주(전환)',  '아모레G보통주',  '아모레퍼시픽 1우선주', '아모레퍼시픽 보통주',  '아세아보통주',  '아세아시멘트보통주',  '아세아제지보통주',  '아센디오보통주', '아시아나IDT보통주',  '아시아나항공 보통주',  '아이마켓코리아보통주',  '아이에스동서보통주',  '아주스틸보통주',  '알루코 보통주',  '애경산업보통주', '애경케미칼보통주', 
  '에넥스보통주', '에스디바이오센서보통주',  '에스비에스보통주', '에스엘보통주',  '에스원보통주',  '에스지세계물산보통주',  '에스케이디스커버리1우선주',  '에스케이디스커버리보통주',  '에스케이렌터카보통주',  '에스케이바이오사이언스보통주', '에스케이바이오팜보통주',  '에스케이하이닉스보통주',  '에쓰씨엔지니어링보통주',  '에어부산보통주',  '에이블씨엔씨보통주',  '에이엔피보통주',  '에이자기관리부동산투자회사보통주',  '에이치디씨아이콘트롤스보통주',  '에이치디씨현대이피보통주',  '에이치에스디엔진보통주', '에이치엠엠보통주', '에이프로젠메디신보통주',
    '에이프로젠제약보통주',  '에이플러스에셋보통주',  '엔씨소프트보통주', '엔에스쇼핑보통주',  '엔에이치기업인수목적19호보통주',  '엔에이치올원리츠보통주', '엔에이치투자증권1우선주',  '엔에이치투자증권보통주',  '엔케이 보통주',  '엘브이엠씨홀딩스보통주',  '엘에스전선아시아보통주',  '엘엑스하우시스1우선주',  '엘엑스하우시스보통주',  '엘엑스홀딩스1우선주',  '엘엑스홀딩스보통주',  '엘지헬로비전보통주',  '엠씨넥스보통주',  '영보화학보통주',  '영원무역보통주',  '영원무역홀딩스보통주', '영진약품보통주',  '영풍보통주',  '영풍제지보통주',  '영화금속보통주',  
    '영흥보통주',  '예스코홀딩스보통주',  '오뚜기보통주',  '오리엔트바이오보통주',  '오리온보통주',  '오리온홀딩스보통주',  '와이지플러스보통주',  '와이투솔루션보통주',  '우리금융지주보통주',  '우리들휴브레인보통주',  '우리종합금융보통주',  '우성보통주',  '우신시스템보통주',  '우진보통주',  '우진아이엔에스보통주',  '우진플라임 보통주',  '웅진보통주',  '웅진씽크빅 보통주',  '원림보통주',  '웰바이오텍보통주',
  '윌비스보통주', '유니드 보통주',  '유니온머티리얼보통주',  '유니온보통주', '유니켐보통주',  '유니퀘스트 보통주',  '유성기업보통주',  '유수홀딩스보통주',  '유안타증권1우선주',  '유안타증권보통주',  '유엔젤보통주',  '유유제약1우선주', '유유제약2우선주(신형)',  '유유제약보통주',  '유진투자증권보통주',  '유한양행1우선주',  '유한양행보통주',  '유화증권1우선주',  '유화증권보통주',  '율촌화학보통주',  '이건산업보통주',  '이구산업보통주',  '이노션보통주',  '이리츠코크렙기업구조조정부동산투자회사보통주',  '이마트보통주',  '이수페타시스보통주',
  '이수화학보통주',  '이스타코보통주',  '이아이디보통주',  '이엔플러스보통주',  '이연제약보통주',  '이월드보통주',  '이지스레지던스리츠보통주',  '이지스밸류플러스리츠보통주',  '이화산업보통주',  '인디에프보통주',  '인바이오젠보통주',  '인스코비보통주',  '인지컨트롤스보통주',  '인천도시가스 보통주',  '인터지스보통주',  '인팩보통주',  '일동제약보통주',  '일동홀딩스보통주',  '일성건설보통주',  '일성신약보통주',  '일신방직보통주',  '일신석재보통주',  '일양약품1우선주',  '일양약품보통주',  '일정실업보통주',  '일진다이아몬드 보통주',  
  '일진디스플레이보통주',  '일진머티리얼즈보통주',  '일진전기 보통주',  '일진하이솔루스보통주',  '일진홀딩스보통주',  '잇츠한불보통주',  '자이에스앤디보통주',  '자화전자보통주',  '전방보통주',  '제이알글로벌리츠보통주',  '제이에스코퍼레이션보통주',  '제이준코스메틱보통주',
  '제이콘텐트리보통주',  '제일기획보통주',  '제일약품보통주',  '제일연마공업보통주',  '제일파마홀딩스보통주',  '제주은행보통주',  '제주항공보통주',  '조광페인트보통주',  '조광피혁보통주',  '조비보통주',  '조선내화보통주',  '조선선재 보통주',  '조일알미늄보통주',  '조흥보통주',  '종근당바이오보통주',  '종근당보통주',  '종근당홀딩스보통주',  '주식회사 용평리조트',  '주식회사동남합성',  '주식회사케이씨씨',  '주연테크 보통주',  '중소기업은행보통주',  '지누스보통주',  '지에스글로벌보통주',  '지에스리테일보통주',  '지엠비코리아보통주',
  '지역난방공사보통주',  '지코보통주',  '지투알보통주',  '진도 보통주',  '진양산업보통주',  '진양폴리우레탄보통주',  '진양홀딩스보통주',  '진양화학보통주',  '진에어보통주', '진원생명과학보통주',  '진흥기업1우선주(신형)',  '진흥기업2우선주(신형)',  '진흥기업보통주',  '참엔지니어링보통주',  '천일고속보통주',  '체시스보통주',  '카카오뱅크보통주',  '카카오보통주',  '카카오페이보통주',  '카프로보통주',  '컨버즈보통주',  '케이비아이동국실업보통주',  '케이씨그린홀딩스보통주',  '케이씨보통주',  '케이씨씨글라스보통주',  '케이씨코트렐보통주',  
  '케이씨텍보통주',  '케이에스에스 해운 보통주',  '케이이씨 보통주',  '케이카보통주',  '케이탑리츠보통주',  '케이티보통주',  '케이티비투자증권보통주',  '케이티스카이라이프',  '케이티씨에스보통주',  '케이티아이에스보통주', '케이티앤지보통주',  '코람코에너지플러스리츠보통주',  '코리아써키트1우선주',  '코리아써키트2우선주(신형)',  '코리아써키트보통주',  '코리안리재보험보통주',  '코스맥스보통주', '코스맥스비티아이 주식회사 보통주',  '코스모신소재보통주',  '코스모화학보통주',  '코아스보통주',  '코오롱1우선주',  '코오롱글로벌1우선주',  
  '코오롱글로벌보통주',  '코오롱보통주',  '코오롱인더스트리1우선주',  '코오롱인더스트리보통주',  '코오롱플라스틱보통주',  '코웨이보통주',  '콤텍시스템보통주',  '쿠쿠홀딩스보통주',  '쿠쿠홈시스보통주',  '큐로보통주',  '크라운제과1우선주',  '크라운제과보통주',  '크라운해태홀딩스1우선주',  '크라운해태홀딩스보통주',  '크래프톤보통주',  '키다리스튜디오보통주',  '키움증권보통주',  '태경비케이보통주',  '태경산업보통주',
  '태경케미컬보통주',  '태광산업보통주',  '태림포장보통주',  '태양금속공업1우선주', '태양금속공업보통주',  '태영건설보통주', '태영건설우선주',  '태원물산보통주', '태평양물산보통주',  '테이팩스보통주',  '텔코웨어 보통주',  '토니모리보통주',  '티에이치엔보통주',  '티와이엠보통주',  '티와이홀딩스1우선주',  '티와이홀딩스보통주',  '티웨이항공보통주',  '티웨이홀딩스보통주',  '파미셀보통주',  '팜스코보통주', '팜젠사이언스보통주',  '팬오션보통주',  '퍼스텍보통주',  '퍼시스보통주',  '페이퍼코리아보통주',  '평화산업 주식회사 보통주',  
  '평화홀딩스보통주',  '포스코강판보통주',  '포스코보통주',  '포스코인터내셔널보통주',  '포스코케미칼보통주',  '폴루스바이오팜보통주',  '풀무원보통주',  '풍산 보통주',  '풍산홀딩스보통주',  '프레스티지바이오파마KDR',  '플레이그램보통주',  '피아이첨단소재보통주',  '하나금융지주보통주',  '하나제약보통주',  '하나투어보통주',  '하이골드오션12호국제선박투자회사',  '하이골드오션3호선박투자회사',  '하이브보통주',  '하이스틸 보통주',  '하이트론씨스템즈보통주',  '하이트진로2우선주(신형)',  '하이트진로보통주',  '하이트진로홀딩스1우선주',
  '하이트진로홀딩스보통주',  '한국가스공사보통주',  '한국공항보통주',  '한국내화보통주', '한국단자공업보통주',  '한국베트남부동산개발특별자산1호투자회사',  '한국석유공업보통주', '한국수출포장공업보통주',  '한국쉘석유보통주',  '한국앤컴퍼니보통주',  '한국유나이티드제약 보통주',  '한국자산신탁보통주',  '한국전력공사보통주',  '한국전력기술 보통주',  '한국전자홀딩스보통주',  '한국조선해양보통주',  '한국종합기술보통주',  '한국주강보통주', '한국주철관공업보통주',  '한국철강보통주',  '한국카본보통주',  '한국콜마보통주',  '한국콜마홀딩스보통주',
  '한국타이어앤테크놀로지보통주',  '한국토지신탁보통주', '한국투자ANKOR유전해외자원개발특별자산투자회사1호(지분증권)',  '한국투자Parallel유전해외자원개발특별자산투자회사1호',  '한국투자금융지주1우선주',  '한국투자금융지주보통주',  '한국특강보통주', '한국프랜지공업보통주',  '한국항공우주산업보통주',  '한국화장품보통주',  '한국화장품제조보통주',  '한농화성보통주',  '한독보통주',  '한라보통주',  '한라홀딩스보통주',  '한미글로벌건축사사무소보통주',  '한미반도체보통주',  '한미사이언스보통주', '한미약품보통주',  '한샘보통주',  '한섬보통주', 
   '한성기업보통주',  '한세실업보통주',  '한세엠케이보통주', '한세예스24홀딩스보통주',  '한솔PNS보통주',  '한솔로지스틱스보통주',  '한솔제지보통주',  '한솔케미칼보통주',  '한솔테크닉스보통주',  '한솔홀딩스보통주',  '한솔홈데코보통주',  '한신공영보통주',  '한신기계공업보통주',  '한양증권1우선주',  '한양증권보통주',  '한온시스템보통주',  '한올바이오파마보통주',  '한익스프레스보통주',  '한일시멘트보통주',  '한일철강보통주',  '한일현대시멘트보통주',  '한일홀딩스보통주',  '한전KPS 보통주',  '한전산업개발보통주',  '한진보통주',  
   '한진중공업 보통주',  '한진중공업홀딩스보통주',  '한진칼1우선주',  '한진칼보통주',  '한창보통주',  '한창제지보통주',  '한컴라이프케어보통주',  '한화1우선주',  '한화3우선주(신형)',  '한화보통주',  '한화생명보험보통주',  '한화손해보험보통주',  '한화솔루션1우선주', '한화솔루션보통주',  '한화시스템보통주',  '한화에어로스페이스보통주',  '한화투자증권1우선주',  '한화투자증권보통주',  '해성디에스보통주',
  '해태제과식품주식회사',  '핸즈코퍼레이션보통주',  '현대건설1우선주',  '현대건설기계보통주',  '현대건설보통주',
  '현대그린푸드보통주',  '현대글로비스보통주',  '현대두산인프라코어보통주',  '현대로템보통주',  '현대리바트보통주',
  '현대모비스보통주', '현대미포조선보통주',  '현대백화점보통주',  '현대비앤지스틸1우선주',  '현대비앤지스틸보통주',  '현대약품보통주',  '현대에너지솔루션보통주',  '현대엘리베이터보통주',  '현대오토에버보통주',  '현대위아보통주',  '현대일렉트릭보통주',  '현대자동차1우선주',  '현대자동차2우선주(신형)',  '현대자동차3우선주(신형)',  '현대자동차보통주',  '현대제철 보통주', '현대중공업보통주',  '현대중공업지주보통주',  '현대차증권보통주',  '현대코퍼레이션보통주',  '현대코퍼레이션홀딩스보통주',  '현대퓨처넷보통주', '현대해상화재보험보통주',  '현대홈쇼핑보통주',  '형지엘리트보통주',  '혜인보통주',  '호전실업보통주', '호텔신라1우선주',  '호텔신라보통주',  '화성산업보통주',  '화승알앤에이보통주',  '화승엔터프라이즈보통주',  '화승인더스트리보통주',  '화승코퍼레이션보통주',  '화신보통주',  '화인베스틸보통주',  '화천기계보통주',
  '화천기공보통주',  '환인제약보통주',  '황금에스티보통주',  '효성보통주',  '효성아이티엑스 보통주',  '효성중공업보통주',  '효성첨단소재보통주',  '효성티앤씨보통주',  '효성화학보통주',  '후성 보통주',  '휠라홀딩스보통주',  '휴니드테크놀러지스보통주',  '휴비스보통주',
  '휴스틸보통주', '휴켐스보통주',  '흥국화재해상보험1우선주',  '흥국화재해상보험2우선주(신형)',  '흥국화재해상보험보통주','흥아해운보통주',
];

/*initiate the autocomplete function on the "myInput" element, and pass along the countries array as possible autocomplete values:*/
autocomplete(document.getElementById("myInput"), countries);